[ {
    "src":"./assets/bulihan.jpg",
    "date":"2023-07-15 12:20:00",
    "title":“BULIHAN: Mga Kuwento ng Labanan at Kabayanihan”,
    "subtitle":"Isang karangalan para sa Richwell Colleges na tanghaling FINALIST ang Opisyal nitong Entri na pinamagatang “BULIHAN: Mga Kuwento ng Labanan at Kabayanihan” sa 5th SINELIKSIK Bulacan Docufest 2023... ",
    "readmoretxt":"Isang karangalan para sa Richwell Colleges na tanghaling FINALIST ang Opisyal nitong Entri na pinamagatang “BULIHAN: Mga Kuwento ng Labanan at Kabayanihan” sa 5th SINELIKSIK Bulacan Docufest 2023. <br><br> Bilang isang pamilya ng Richwell Colleges, sama-sama nating suportahan at ipanalangin ang ating Richwell Colleges Production team.<br><br>#RichwellColleges<br> #SINELIKSIK<br> #SINELIKSIKBulacanDocufest2023"

}, {
    "src":"./assets/ScholarsOrientation.jpg",
    "date":"2023-07-08 12:20:00",
    "title":"Richwell Scholarship Foundation",
    "subtitle":"The program was well-attended where Richwell President and CEO, Mr. Romeo “Bobby” Dela Rosa highlighted the importance of the opportunities and responsibilities of being a Richwellian Scholar... ",
    "readmoretxt":"Richwell Scholarship Foundation conducted its Parent/Guardian and Scholars Orientation today at Richwell Event Center. <br><br>Richwell Scholarship Foundation conducted its Parent/Guardian and Scholars Orientation today at Richwell Event Center. <br> <br>Through the orientation, the scholars together with their parents are now determined to achieve the promise of Success and Prosperity through the newly-established foundation.<br><br>#RichwellColleges #RichwellScholarshipFoundation"

}, {
    "src":"./assets/bjmp.jpg",
    "date":"2023-07-07 12:20:00",
    "title":"Richwell Colleges Career Opportunities Forum with BJMP Plaridel",
    "subtitle":"Today, Richwell Colleges in partnership with BJMP Plaridel successfully organized a Career Opportunities Forum as part of their extension service program...",
    "readmoretxt":"Today, Richwell Colleges in partnership with BJMP Plaridel successfully organized a Career Opportunities Forum as part of their extension service program. <br> <br> SJO3 Jayson M. Zorilla and JO2 Hanna Cindy A. Gregorio served as resource speakers. They shared their expertise and experiences in the field. JINSP. Ma. Cristina R. Busacay, BJMP Plaridel Female Dormitory Warden was also present in the program. <br> <br> Richwell Colleges and BJMP Plaridel are proud to have provided this opportunity for students to explore potential career options and make informed decisions about their future.<br> <br> #RichwellColleges #BJMPPlaridel #CareerOpportunitiesForum"

},
    {
    "src":"./assets/29.jpg",
    "date":"2023-06-29 12:20:00",
    "title":"Richwell Colleges Training Induction Program",
    "subtitle":"Richwell Colleges successfully conducted the Training Induction Program on June 29, 2023, with an impressive attendance of 114 trainees. This program is aligned with the implementation of the Training for Work Scholarship...",
    "readmoretxt":"Richwell Colleges successfully conducted the Training Induction Program on June 29, 2023, with an impressive attendance of 114 trainees. This program is aligned with the implementation of the Training for Work Scholarship Program (TWSP) and Private Education Student Fund Assistance (PESFA). <br> <br> Our institution is honored to have the esteemed presence of District II House Representative Congresswoman Augustina Dominique 'Ditse Tina' Pancho and TESDA Bulacan - Provincial Director Maria Gerty D. Pagaran.<br> <br> Richwell Colleges together with TESDA and Ditse Tina continuously strengthen their commitment to empowering students and promoting quality education. <br> <br>#RichwellColleges <br>#TrainingInductionProgram"

},
{
    "src":"./assets/100.jpg",
    "date":"2023-06-02 12:20:00",
    "title":"Richwell Colleges Incorporated sealed a new Partnership with Royal Institution Singapore ",
    "subtitle":"The Royal Institution Singapore was represented by its President, Dr. Athena Georgene Ang while the Ascendens Asia was represented by its President and CEO Dr. Glenn Cabacang and the AAHRMEI was represented...",
    "readmoretxt":"Richwell Colleges Incorporated sealed a new Partnership with Royal Institution Singapore (RI), Ascendens Asia (AA), and the Association of Administrators in Hospitality Hotel and Restaurant Management Educational Institution (AAHRMEI) on June 3,2023 held at Richwell Audio-Virtual room. <br><br>The Royal Institution Singapore was represented by its President, Dr. Athena Georgene Ang while the Ascendens Asia was represented by its President and CEO Dr. Glenn Cabacang and the AAHRMEI was represented by its President Emeritus Dr. Gloria Baken Siy. <br><br>Through the vision and directions of Richwell Colleges’ President and CEO, Mr. Romeo L. Dela Rosa who is also a Senior Fellow of the Royal Institute of Management led the Partnership Day with the different organizations to foster stronger partnerships in holding international research conferences and publications.<br><br>#RichwellPartnershipDay<br>#RoyalInstitutionSingapore<br>#AscendensAsia<br>#AAHRMEI<br>#SoarhighRichwellColleges<br>"

},

{
    "src":"./assets/5.jpg",
    "date":"2023-04-29 12:20:00",
    "title":"“Kalutong Bulakenyo: A Guide to Culinary Heritage of Bulacan.”",
    "subtitle":"Richwell Colleges, Incorporated took part in the Filipino Month Celebration as a partner of the Provincial History Arts Culture and Tourism Office (PHACTO) of Bulacan in the book launching of...",
    "readmoretxt":"Richwell Colleges, Incorporated took part in the Filipino Month Celebration as a partner of the Provincial History Arts Culture and Tourism Office (PHACTO) of Bulacan in the book launching of “Kalutong Bulakenyo: A Guide to Culinary Heritage of Bulacan.” Our institution headed by our President and CEO, Mr. Romeo L. Dela Rosa is an active partner of the government in promoting and preserving our rich history and heritage."

},
{
    "src":"./assets/4.jpg",
    "date":"2023-04-20",
    "title":"CHAMPION - Provincial Meet",
    "subtitle":"Congratulations, Richwell Men’s Volleyball Team - College Level! <br> Your Richwell Colleges family is so proud of you! <br> #TatakRichwell</p>",
    "readmoretxt":"  CHAMPION BULPRISA Provincial Meet<br> <br> Congratulations, Richwell Men’s Volleyball Team - College Level!<br> Your Richwell Colleges family is so proud of you!<br><br>#TatakRichwell "

},
{
    "src":"./assets/3.jpg",
    "date":"2023-02-19 ",
    "title":"Senior Scout Investiture - Boy Scout of the Philippines",
    "subtitle":"Richwell Colleges, Incorporated successfully holds the Boy Scout of the Philippines Institutional Investiture and 1st Encampment Program at the school ground last February 10 – 11, 2023, in partnership with the Boys Scout of the Philippines – Bulacan Chapter.",
    "readmoretxt":"Congratulations, Richwell Colleges Scout Unit – Outfit 535! <br> Richwell Colleges, Incorporated successfully holds the Boy Scout of the Philippines Institutional Investiture and 1st Encampment Program at the school ground last February 10 – 11, 2023, in partnership with the Boys Scout of the Philippines – Bulacan Chapter."

}
,
{
    "src":"./assets/2.jpg",
    "date":"2023-02-06",
    "title":"Bulprisa District 2 Athletic Meet Winners as of Feb 6, 2023",
    "subtitle":"Congratulations Richwellians! We are proud of you! To God be the glory!",
    "readmoretxt":"  Basketball Women 1st Runner up Silver Award <br><br>  3x3 Basketball Women 1st Runner up  Silver Award <br><br>  Basketball Men  3rd Runner up<br> <br>  Congratulations Richwellians! <br>  We are proud of you! To God be the glory!"

},
{
    "src":"./assets/1.jpg",
    "date":"2023-02-02 ",
    "title":"Bulprisa District 2 Athletic Meet Winners as of Feb 2, 2023",
    "subtitle":"Congratulations Richwellians! We are proud of you! To God be the glory!",
    "readmoretxt":" Volleyball Women <br> 2nd Placer<br><br>Volleyball Men<br> 4th Placer<br> Shinji Saito<br><br> Badminton Singles (Men)<br> 3rd Placer - Bronze Medalist<br><br>  Congratulations Richwellians! <br> We are proud of you! To God be the glory!"

},
{
    "src":"./assets/silk.jpg",
    "date":"2022-11-28 ",
    "title":"Richwell Colleges and CHINA PHILIPPINES SILK ROAD INSTITUTE FOUNDATION",
    "subtitle":"Richwell Colleges is truly one of a kind, a very good model for other institutions in the Philippines to emulate,” -Ms. Vivian Zhang, President, China-Philippines Silk Road Institute Foundation",
    "readmoretxt":"“Richwell Colleges is truly one of a kind, a very good model for other institutions in the Philippines to emulate,” -Ms. Vivian Zhang, President, China-Philippines Silk Road Institute Foundation.<br><br>Today, Richwell Colleges Incorporated conducted its first-ever signing of Memorandum of Understanding with its new internationally-acclaimed partner, the China-Philippines Silk Road Institute Foundation today at Richwell Event Center.<br><br> The MOU signing ceremony was attended by the school board and school administrators headed by President and CEO of Richwell Colleges, Mr. Romeo L. Dela Rosa together with its new partner Ms. Vivian Zhang, President, China-Philippines Silk Road Institute Foundation accompanied by the former CHED Director, Dr. Amelia A. Biglete.<br><br>  Richwell Colleges celebrates this great milestone as it continues to soar high even in the International Academic community! <br><br> #RichwellCollegesIncorporated<br> #RichwellGoesInternational<br> #SoarHighRichwellians<br></div>"

},
{
    "src":"./assets/tesda.jpg",
    "date":"2022-10-21",
    "title":"“Salamat sa TESDA”",
    "subtitle":"“Ito ang naging pahayag ng bawat nagsipagdalo sa makasaysayang TESDA Appreciation Day ng Richwell Colleges sa pangunguna ng  President and CEO na si G. Romeo L. Dela Rosa sa kanyang pambungad na pananalita.",
    "readmoretxt":" Ito ang naging pahayag ng bawat nagsipagdalo sa makasaysayang TESDA Appreciation Day ng Richwell Colleges sa pangunguna ng  President and CEO na si G. Romeo L. Dela Rosa sa kanyang pambungad na pananalita.<br><br>  Naging makasaysayan ang pagdiriwang dahil dinaluhan ito ni TESDA Director General Atty. Danilo P. Cruz na siyang naging panauhing pandangal at ni Congresswoman Ditse Tina Pancho ng Ikalawang Distrito ng Bulacan, kasama ang mga pinagpipitaganang opisyal ng TESDA Region III at TESDA Bulacan, mga mag-aaral, guro at kawani ng paaralan."

},
{
    "src":"./assets/36.jpg",
    "date":"2021-07-23",
    "title":"Richwell Colleges on its 5th Year: Blessed with 3,000 students",
    "subtitle":"“Plant seeds of happiness, hope, success, and love; it will all come back to you in abundance.” That is how Richwell Colleges Incorporated began...",
    "readmoretxt":"“Partnership is relationship. Today our relationship is renewed!” <br><br>-Mrs. Teresa S. Viernes, Department Head of Municipal Social Welfare and Development Office, Municipality of Plaridel, Bulacan Overwhelmed and greatly elated, the entire Day Care Workers from Plaridel truly had a blast as Richwell Colleges, PBC Sunbeam School and Plaridel Day Care Centers sealed the momentous Partnership Day held today, July 23, 2021 at Richwell Event Center.<br><br> Indeed, the education of the youths of Plaridelenyos from early childhood care to college are ensured because of this great PARTNERSHIP!"

},
{
    "src":"./assets/35.jpg",
    "date":"",
    "title":"History of Richwell Colleges",
    "subtitle":"Our late parents Manuel Galvez Dela Rosa and Paz de Leon Dela Rosa have been our inspiration from the beginning. They have been blessed with 10 wonderful children, whom they raised well, through their hard work and dedication... by Romeo L. Dela Rosa",
    "readmoretxt":"Our late parents Manuel Galvez Dela Rosa and Paz de Leon Dela Rosa have been our inspiration from the beginning. They have been blessed with 10 wonderful children, whom they raised well, through their hard work and dedication. Despite their circumstances, my father being a farmer and my mother being a housewife, they did not let that hinder their goals and aspirations for us, they put a premium on all of us finishing college and having a better future. I believe through the great example that my parents put forward, we inherited that drive to work hard for anything we want to achieve. Also, putting an enormous value on education remained in our hearts and minds. <br> <br>In 2014, our family, with the vision and heart of our eldest brother, our chairman, Mr. Rufino Dela Rosa along with my educational management experience of over 20 years, we opened the doors of Richwell Colleges Incorporated. The concept that helped shaped the establishment of Richwell Colleges, came from a program we ran in PBC Sunbeam School. We called it the Stone Bridge Foundation, this program classifies and selects deserving and talented students that do not have the financial capability to continue their tertiary studies. The program gave these students the opportunity to continue their education worry free. Due to the success of the program, naturally, discussions of propagating its achievement gave birth to the idea of establishing a college in Plaridel, this pave the way to the beginnings of Richwell Colleges Incorporated.  <br> <br>The two hectare land that our Chairman Rufino Dela Rosa owns in Brgy. San Jose, of Plaridel, Bulacan became the site where we would begin venture into new territory. All my years of educational experience did not cover tertiary education, hence the hesitation as we began the project. However, my hesitation was replaced by excitement knowing that our vision of educating the poorest of the poor in our hometown Plaridel is within reach. We were at the verge of touching and changing the lives of many Plaridelenyos. With a grateful heart and clear vision, last January 29, 2014 Richwell Colleges had its groundbreaking ceremonies.  <br> <br> Last June 2015, our Technical Vocational Bundle Courses began with 167 students. These students saw for the first time the four-storey school building with state of the art facilities, along with 30 instructional rooms. The “Study Now, Pay Later” program was personally funded by the Board of Directors of Richwell Colleges. The personal touch does not end there, no less than our Chairman and myself interviewed the potential candidates for this program. One scholar stood out when he gave his reason for joining the program. He mentioned that his sister would sacrifice for the family just to send him to school. Because of the heartbreaking scenario, my brother and I just couldn’t let this happen without intervening. We decided to take both of them as our scholar. Fast forward this year, 2019, both of them have successfully graduated and are now working professionally helping their family.  <br> <br>As I mentioned earlier, Richwell Colleges is not only a new facility, it is a state of the art establishment with the latest equipment. In 2015, no less than TESDA had given our institution the honor and privilege of becoming an Assessment Center in the province of Bulacan. This means our students who are taking up Hospitality and Restaurant Services are not only being taught using the latest equipment, they also do not have to go anywhere to get assessed because of this privilege. Lastly, this blessing of becoming an Assessment Center in the province of Bulacan, also introduces our institution to those students that are going to be assessed for a National Certificate. They get to see how great our facilities and equipment are, building our provenance early and further within the province of Bulacan.  <br> <br> During 2016, our national education system had been redesigned by our government to compete with international standards. This began the transition to K to 12. The additional two years of senior high school brings a unique pre-college experience to the students by preparing them for whatever educational path (strands) they would be taking after senior high school. From Science & Technology, Engineering and Maths (STEM) to Humaniteis and Social Sciences (HUMMS), the students are now primed to adapt better whichever educational strand they take. Richwell Colleges was able to capitalize on the voucher system that the DEPED had implemented for senior high school enrollees. This meant that all those who are enrolling will not be paying and tuition fees because the government is funding it. Being a private institution, Richwell had the ability to put additional fees for further profit, however our Chairman and Board Members stayed true to our vision of educating the poorest of the poor. This decision impacted thousands of families in the last five years of our school’s existence.  <br> <br> As an institution, we are continually blessed as we received news that we will now be able to not only replicate but be able to open our “Study Now, Pay Later” program through the through the passing of Republic Act 10931 also known as the “Universal Access to Quality Tertiary Education” which provides the free tuition and other school fees, our institution was also granted subsidy from CHED. This educational funding is called as Tertiary Education Subsidy (TES). This means all students that resides in Plaridel, Bulacan can now study in Richwell Colleges, for free and with allowance.  <br> <br>Today, Richwell Colleges had further improvements in our facility, with the creation of two additional academic buildings and a 600 - 800 seater Events Center. Also, this year, our total population of Senior High School, TESDA and College Students are roughly 3,000. Roughly 90% of which are Plaridelenyos and 10% belonging to neighboring municipalities.  <br> <br> From our dreams, to a concrete vision, to fruition, Richwell College Incorporated will never have been, if not for Grace and Bounties given by God. It is true that without the love and hard work of our parents, none of this would come true. Through our parents belief and value for education, we will be true to our advocacy that Success and Prosperity starts at Richwell Colleges, and with our head held up high we can preach -- “We Can, We will… by the Grace of God.”"

},
{
    "src":"./assets/34.jpg",
    "date":"",
    "title":"Richwell’s CHED – UNIFAST Center",
    "subtitle":"Commission on Higher Education (CHED) praised Richwell Colleges for a well-organized distribution of UNIFAST Tertiary Education Scholarship subsidy to its college students.According to Ms. Lora L. Yusi, the Officer-in-Charge of CHED Regional Office III..",
    "readmoretxt":"Commission on Higher Education (CHED) praised Richwell Colleges for a well-organized distribution of UNIFAST Tertiary Education Scholarship subsidy to its college students. <br><br>According to Ms. Lora L. Yusi, the Officer-in-Charge of CHED Regional Office III, she was so happy as the school was able to come-up with a systematic way of grant distribution. <br><br>As one of the TES grantees’ pioneering school, Richwell Colleges was able to build and design the CHED – UNIFAST Center where the students can process their subsidy withdrawal and savings account. <br><br>“Nakatutuwa po dahil hindi po kami nahihirapan sa pagkuha at pagpaprocess ng aming subsidy. Bago man po ang Richwell pero, iba po yung system nila sa distribution of grants dahil sobrang organized nila,” Carlo Tamayo said, a BSAIS 2 student. <br><br>Aside from that, Gina Ongog, BTVTEd freshmen student, shared that Richwell Colleges ensures that all the grantees are enabled to attend their classes as they avail weekly allowances at the CHED – UNIFAST Center to cover and support their daily transportation and other school related expenses."

},
{
    "src":"./assets/33.jpg",
    "date":"2019-08-30",
    "title":"Richel Kalaw, Itinanghal bilang Pambasang TAGSANAY 2019",
    "subtitle":"Pinatunayan ni Gng. Richel C. Kalaw ang kanyang husay at galing matapos n’yang maiuwi ang titulo at kilalanin bilang Tagsanay 2019 sa tagisan ng mga taga-sanay sa buong Pilipinas na ginanap nito lang ika-30 na Agosto sa Lungsod ng Taguig...",
    "readmoretxt":"Pinatunayan ni Gng. Richel C. Kalaw ang kanyang husay at galing matapos n’yang maiuwi ang titulo at kilalanin bilang Tagsanay 2019 sa tagisan ng mga taga-sanay sa buong Pilipinas na ginanap nito lang ika-30 na Agosto sa Lungsod ng Taguig.  <br><br> Pumailanglang si Kalaw, Tagapamahala ng Programa ng Technical-Vocational and Livelihood (TVL) ng Richwell Colleges, matapos malagpasan ang 32 pang mga kapunyagi galing sa ibat-ibang rehiyon at makalikom ng 395.5 puntos mula sa 500 sa mga patimpalak, eksaminasyon, at panayam. Bukod rito, ang kan’yang awtput ay kinilala bilang Best in Training Enhancement Package na nagpapakita ng mga teknik at stratehiya ng institusyong TVL sa pagpapayabong at pagpapaunlad ng handog nitong mga kurso. <br><br>Ang nasabing pambansang patimpalak ay pinamunuan ng TESDA National TVET Trainers Academy (NTTA) na naglalayong pumili ng pinakamahusay na taga-sanay sa Pilipinas. Ito ay dumaan sa dalawang lingo na puno ng aktibidad kasabay ng pagsala para mapili kung sino ang pinaka huwaran. Lahat ng kumatawan sa ibat-ibang rehiyon ay sumailalim sa proseso simula sa antas ng panlalawigan na nagtatapos sa isang linggong pambansang programa ng pagpili, kung saan ang pangwakas na yugto ay sinubok at sinuri ang kani-kanilang lohika, balanse, mga kasanayan sa negosasyon, tapang, panlasa, at kakayahang makitungo sa mga bagong hamon. Kasabay nito ay ang pagsuri sa kani-kanilang isinumiteng portfolio. <br><br>Ayon sa kan’ya, ang lahat ng kaba ay nanatili hanggang makababa s’ya ng entablado na bitbit na ang tropeyo ng tagumpay – tropeyong bunga ng paghihirap. Aniya pa, ang kanyang pagkapanalo ay hindi lang sa kan’ya, kun’di sa buong Rehiyon III at sa Richwell Colleges na lubos na sumusuporta."

},
{
    "src":"./assets/32.jpg",
    "date":"2019-07-02",
    "title":"Richwell Colleges Iconic Shuttle System",
    "subtitle":"Richwell Colleges offered their students an efficient and cost-effective transportation services through its Shuttle Service System, which was implemented this school year.The Shuttle Services started its operations last July 2, 2019 with its point-to-point route from Lugam...",
    "readmoretxt":"Richwell Colleges offered their students an efficient and cost-effective transportation services through its Shuttle Service System, which was implemented this school year. <br><br>The Shuttle Services started its operations last July 2, 2019 with its point-to-point route from Lugam, City of Malolos to RCI campus, where students are picked-up on a scheduled time for morning and afternoon shifts initially utilized by 50 students. <br><br>Compared to other means of transportation, the shuttle fare only cost the student between 20-30 pesos depending on the distance from their pick-up point. The students were able to arrive at school on time, which caused them to be more disciplined by learning proper time management. <br><br>“Nakakatipid po talaga kami sa pamasahe, kasi noong namamasahe po kami papunta sa Richwell, gumagastos po kami ng more than 60 pesos. Bukod po roon, hindi na rin po hassle ang byahe dahil malamig at komportable po ang service.” Aira Joy Aguilar, one of the beneficiaries of the said services. <br><br>Richwell Colleges Shuttle Service System really helped students to save money. Being able to have a reliable means of going to school and back to house carefree, safe and convenient is one way RCI makes the student’s life better."

},
{
    "src":"./assets/37.jpg",
    "date":"2019-08-05",
    "title":"CHED – UNIFAST General Assembly",
    "subtitle":"Grantees of Tertiary Education Scholarship (TES) attended the general assembly held last August 5, 2019 at RCI Events Center, which aims to reiterate the guidelines of CHED- UNIFAST TES and to familiarize on different school policies...",
    "readmoretxt":"Grantees of Tertiary Education Scholarship (TES) attended the general assembly held last August 5, 2019 at RCI Events Center, which aims to reiterate the guidelines of CHED- UNIFAST TES and to familiarize on different school policies. <br><br>Mr. Romeo L. Dela Rosa, School President and CEO, shared inspirational words after he talked about the story of how the school’s aspirations became reality. He said that before CHED approved the pioneering grantees for UNIFAST TES program last academic year with more than 100 students, RCI is already catering and helping less-fortunate youth who dreamt of finishing college through its “Study Now, Pay Later” (SNPL) program. <br><br>Shiela Mae Villaralbo testifies and shared her experiences of being a grantee of SNPL program during her first year, which really helped her to pursue college. Now, she is capable to pay her school fees through her TES grant. <br><br>The Vice President for Academic Affairs, Dr. Luzviminda Tantoco, on the other hand, tackled the students’ obligations and responsibilities. She even pointed-out to the college students the importance of being disciplined. <br>“Wala na kayong ibang gagawin kung hindi ang mag-aral,” Dr, Tantoco said, “Ang hinihingi na lang sa atin ngayon ay ang maging disciplined students.”Aside from them, Ms. Roberta Castro, the School Discipline Officer; Ms. Eliizabeth Hipolito, the School Registrar; and Mr. Elmar Cundangan, the Student Affairs Director; also discussed some points to remember in terms of school rules and involvement."

},
{
    "src":"./assets/31.jpeg",
    "date":"",
    "title":"Tagumpay ni Sharmaine Mercado sa UAE",
    "subtitle":"Hindi malimutan ni Sharmaine Mercado ang naging takbo ng kaniyang buhay matapos niyang makapagtapos ng pag-aaral sa tulong ng Study Now, Pay Later program ng Richwell Colleges at magkaroon ng pagkakataong ...",
    "readmoretxt":"Hindi malimutan ni Sharmaine Mercado ang naging takbo ng kaniyang buhay matapos niyang makapagtapos ng pag-aaral sa tulong ng Study Now, Pay Later program ng Richwell Colleges at magkaroon ng pagkakataong makapagtrabaho sa loob at labas ng bansa. <br><br>Ayon sa kan’ya, hindi niya inakalang makapagtatapos pa siya ng kursong Cruiseship Hotel and Restaurant Services sa tekbok gayong sa edad na 15 ay nagsimula na siyang mamasukan at magtrabaho. <br><br>Habang siya ay nag-aaral sa Richwell, sinigurado  ni Sharmaine na pagbubutihi’t susulitin niya ang pagkakataong ibinigay sa kanya na tutupad sa mga pangarap niya na makatutulong din sa kanilang pamilya.Natapos ni Sharmaine ng matagumpay ang kanyang pag-aaral, umakyat siya sa entablado nang mayroong ngiti sa mga mata dahil hindi lamang medalya at diploma ang kanyang dala-dala bagkus, maging ang mga kasanayang kaniyang natutunan mula sa Richwell Colleges. Mga kanasayang pang-akademiko at maging ispirituwal. <br><br>Sa kasalukuyan, unti-unti na niyang natutupad ang kaniyang pangarap. Matapos ang pag-aaral at panahon ng pakikipagsapalaran dito sa bansa, siya ngayon ay matagumpay nang namamasukan at nagtatrabaho bilang  Head Sales Staff sa isang kilalang bakery shop  sa UAE, ang Qaser Al Hamra Bakery and Sweets.“Noong una, sales staff lang ako hanggang sa lumipas ang ilang buwan naging parte ako ng cake and pastry production, kung saan nagamit ko ‘yung mga natutunan ko sa Richwell,” pagpapakatotoo niya ukol sa kung paano niya narating ang kanyang kasalukuyang posisyon. <br><br>Tunay na hindi hadlang ang anumang problema upang maabot ang mga pangarap, kailangan lamang nating magpursige upang atin itong matagumpay na malasap. "

},
{
    "src":"./assets/30.jpg",
    "date":"",
    "title":"Testimonya ng Tagumpay ni Renie Lilang",
    "subtitle":"Ako po si Renie Lilang, tubong Romblon, dati po third year high school lang ang natapos dahil sa desisyon ko na pumunta ng Maynila upang makapaghanap ng trabaho. Ito ay sa dahil sa kagustuhan kong makatulong sa aking nanay na makaahon sa hirap at hikahos ng buhay...",
    "readmoretxt":"Ako po si Renie Lilang, tubong Romblon, dati po third year high school lang ang natapos dahil sa desisyon ko na pumunta ng Maynila upang makapaghanap ng trabaho. Ito ay sa dahil sa kagustuhan kong makatulong sa aking nanay na makaahon sa hirap at hikahos ng buhay, lalo na noong pumanaw ang aking ama noong first year high school pa lamang ako. <br><br>Sa murang edad, kung anu-anong trabaho na ang pinasok ko, naging matador, pahinante, at hanggang makapasok sa ako sa isang factory at naging permanenteng empleyado. Nugnit, naisip ko na parang may kulang pa rin sa sarili ko at patuloy na iniisip ko palagi na hanggang dito na lang ba talaga ako at sa ganitong estado na lang ba ako tatanda. Tinatanong ko rin ang aking sarili kung di ko na ba talaga tutupaqrin ang pangarap ko na makaakyat ng barko at maging seaman. At kung minsan din ay dumarating ‘yung oras na naiingit ako sa mga ka-batch ko noong high school dahil halos lahat sila ay nasa barko na at mga successful na. <br><br>Pero, hindi ako nawalan ng pag-asa, dasal ako nang dasal na sana hindi ako mawalan ng pag-asa na makapag-aral ng kolehiyo kahit hindi ko alam kung paano. Hanggang sa dumating yung panahon na kinausap ako ng aking hipag na may anak na nag-aaral sa Sunbeam at binalitaan ako na may magandang oportunidad sa bagong tayong paaralan sa Plaridel, Bulacan. Sabi pa niya, nabanggit daw noon ni Sir Bob (Director ng PBC Sunbeam School at siya ring Pangulo at CEO ng Richwell Colleges) na kung may kakilala raw sila na walang kakayahang makapag-aral sa kolehiyo, may magandang programa daw ang Richwell Colleges, ang Study Now, Pay Later.  Noong binalita ‘yun sa akin ng hipag ko, natuwa ako at agad akong nagpasalamat sa Panginoon. <br><br>Matatagal tagal ko rin pong pinag-isipan ang desisyon ko kung babalik na ba ako sa pag-aaral, iniisip ko kasi noon na regular ako sa factory na pinagtatrabahuan ko at kawawa naman ang nanay ko kung di na ako makapagpapadala sa kanya ng pera. Ngunit, dahil sa kagustuhan ko talaga na makapag aral at panghihinayang kung pakakawalan pa ang pagkakataon, nagdesisyon ako na mag-resign sa trabaho at agad na pumunta sa Richwell. Naalala ko pa noon, si Sir Bob, na ninong ko na sa kasal ngayon, ang nag-interview sa akin noon at tuwang-tuwa siya dahil sa kabila raw ng edad ko ay may pangarap  pa rin daw ako na makapagtapos ng pag-aaral. Nasa 30’s na ako noong panahon na yun, sabi nga nila hindi hadlang ang edad para makapag-aral at maabot ang pangarap at nagtitiwala ako sa Diyos na kaya kong tuparin ang aking pangarap sa tulong Niya at ng Richwell Colleges. <br><br>Dumaan ang mga araw at buwan, nagpapasalamat ako at mapalad na matagumpay akong nakagraduate at naging honor pa sa kursong Cruiship Hotel and Restaurant Services. <br><br>Laking pasasalamat ko dahil mula ng ako ay makapagtapos ng pag-aaral, tunay na nabago ang buhay ko. Unti-unti ko nang natutupad ang mga pangarap ko. Sa kasalukuyan, nakaakyat na ako sa barko at isa na ako sa empleyado ng isang international na cargo ship at nakarating na rin sa iba’t ibang bansa. Natutuwa ako at ang dating pangarap ko lang na puntahan ngayon, napupuntahan ko na. Hindi pa man ako ganoong ka-successful sa buhay, sobrang saya ko na ngayon sa naging career ko sa tulong ng Richwell Colleges. Ito ay dahil kung di sa kanila, wala ako ngayon sa kinalalagyan ko. Kaya’t taos-puso akong nagpapasalamat sa tulong ng Richwell Colleges, kay Elder Raffy na may-ari ng paaralan, kay Ninong Bob at maging sa mga naging guro at lahat ng staff ng Richwell Colleges. "

}


]
