[   
  {
    "s0": "./kong/kong11.jpg",
    "s1": "./kong/kong12.jpg",
    "s2": "./kong/kongsinging.jpg",
    "s3": "./kong/kong8.jpg",
    "s4": "./kong/kong1.jpg",
    "s5": "./kong/kong2.jpg",
    "s6": "./kong/kong3.jpg",
    "s7": "./kong/kong4.jpg",
    "s8": "./kong/kong6.jpg",
    "s9": "./kong/cong5.jpg",
    "s10": "./kong/kong9.jpg",
    "s11": "./kong/kong10.jpg",

    "date": "2024-06-08 08:40:00",
    "title": "Mr. Francis Kong at Richwell Colleges",
    "subtitle": "Richwell Colleges held a career forum featuring renowned speaker Mr. Francis Kong...",
    "readmoretxt": "Richwell Colleges held a career forum featuring renowned speaker Mr. Francis Kong, who shared his wisdom and inspired students to prioritize education, embrace life values, and cherish family as the foundation for a successful future. Additionally, Ms. Melody ''Odette'' Belza-Brillo (member of Executive Mentoring Team of the Top 100 Filipinos on LinkedIn) spoke about her experiences, further motivating students. Their insights surely encouraged Richwellians to pursue their dreams with passion, grounded in education and strong values. A heartfelt thank you to both speakers, especially Mr. Francis Kong, for generously sharing their wisdom with us!"
  },
  {
    "s0": "./assets/richwell-graduation.jpg",
    "s1": "./assets/.jpg",
    "s2": "./assets/.jpg",
    "s3": "./assets/.jpg",
    "date": "2024-06-08 08:40:00",
    "title": "CONGRATULATIONS, SHS STEM GRADUATES!",
    "subtitle": "Yesterday was an unforgettable day as Richwell Colleges celebrated the achievements of 257 extraordinary SHS STEM students on their graduation day.... ",
    "readmoretxt": "Yesterday was an unforgettable day as Richwell Colleges celebrated the achievements of 257 extraordinary SHS STEM students on their graduation day. We can't wait to see you turn your dreams into groundbreaking innovations. Keep dreaming big!.<br><br>#RichwellColleges #TESDA"
  }
  ,
  {
    "s0": "./assets/125.jpg",
    "s1": "./assets/0.jpg",
    "s2": "./assets/0.jpg",
    "s3": "./assets/0.jpg",
    "date": "2024-06-08 08:40:00",
    "title": "Congratulations to our CEO & President, Mr. Romeo Dela Rosa",
    "subtitle": "Congratulations to our CEO & President, Mr. Romeo Dela Rosa, for being the newly elected Vice Chairman of North Luzon Region for Association of Christian Schools, Colleges & Universities...",
    "readmoretxt": "Congratulations to our CEO & President, Mr. Romeo Dela Rosa, for being the newly elected Vice Chairman of North Luzon Region for Association of Christian Schools, Colleges & Universities. Your Richwell family is truly proud of you!. <br>#RichwellColleges #TESDA"
  }
  ,
  {
    "s0": "./assets/124.jpg",
    "s1": "./assets/0.jpg",
    "s2": "./assets/0.jpg",
    "s3": "./assets/0.jpg",
    "date": "2024-06-08 08:40:00",
    "title": "Congratulations to our CEO & President, Mr. Romeo Dela Rosa",
    "subtitle": "For his new appointment as the UniTVET's Vice President for Luzon. Along with this, UniTVET's official hymn which he personally composed was launched... ",
    "readmoretxt": "Congratulations to our college president, Mr. Romeo Dela Rosa, for his new appointment as the UniTVET's Vice President for Luzon. Along with this, UniTVET's official hymn which he personally composed was launched. Your remarkable achievements resonate with pride throughout your Richwell Colleges family. We are truly proud to witness your well-deserved success!."
  }
  ,
  {
    "s0": "./assets/1-16-24.jpg",
    "s1": "./assets/0.jpg",
    "s2": "./assets/0.jpg",
    "s3": "./assets/0.jpg",
    "date": "2024-06-08 08:40:00",
    "title": "TESDA Regional Skills Competition",
    "subtitle": "Richwell Colleges hosted the TESDA Regional Skills Competition on December 18-19, 2023. <br> <br>Participants from different provinces showcased remarkable talent, dedication, and a commitment to mastery in their respective fields....",
    "readmoretxt": "Richwell Colleges hosted the TESDA Regional Skills Competition on December 18-19, 2023.<br>Participants from different provinces showcased remarkable talent, dedication, and a commitment to mastery in their respective fields. We applaud all participants for their outstanding performances and contributions to the success of the competition.<br><br>#RichwellColleges #TESDA"
  }
  ,
  {
    "s0": "./assets/ScholarsOrientation.jpg",
    "s1": "./assets/0.jpg",
    "s2": "./assets/0.jpg",
    "s3": "./assets/0.jpg",
    "date": "2024-06-08 08:40:00",
    "title": "Richwell Scholarship Foundation",
    "subtitle": "The program was well-attended where Richwell President and CEO, Mr. Romeo “Bobby” Dela Rosa highlighted the importance of the opportunities and responsibilities of being a Richwellian Scholar...",
    "readmoretxt": "Richwell Scholarship Foundation conducted its Parent/Guardian and Scholars Orientation today at Richwell Event Center. Richwell Scholarship Foundation conducted its Parent/Guardian and Scholars Orientation today at Richwell Event Center. Through the orientation, the scholars together with their parents are now determined to achieve the promise of Success and Prosperity through the newly-established foundation.<br><br>#RichwellColleges #RichwellScholarshipFoundation"
  }
  
]
